package hw1;

//題目3，請由程式算出256559秒為多少天、多少小時、多少分與多少秒

public class Hw1No3 {
	public static void main(String[] args) {

		int s = 256559; // 一天24小時，1小時60分鐘，1分鐘60秒

		int day = s / 86400; // 256559除以一天有86400秒，可以得出是2天
		int hour = (s % 86400) / 3600; // 256559要先扣除2天的秒數，得出的餘數再除以一小時有60秒，可得出還有23小時
		int minute = ((s % 86400) % 3600) / 60; // 依此類推，再扣除一分鐘60秒，可得出還有15分
		int second = ((s % 86400) % 3600 % 60) % 60; // 因為分鐘算完的餘數即為剩餘秒數，因此用%來計算

		System.out.println("256559秒為" + day + "天" + hour + "小時" + minute + "分" + second + "秒"); // 印出
	}

}
